---
type: BoundingBoxUV
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# BoundingBoxUV

`Autodesk.Revit.DB.BoundingBoxUV` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BoundingBoxUV | — | `` |
| Constructor | BoundingBoxUV | — | `public BoundingBoxUV ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Bounds | — | `public UV this [ int idx ] { get ; }` |
| Property | IsSet | 2021 | `public bool IsSet { get ; }` |
| Property | Max | — | `public UV Max { get ; set ; }` |
| Property | Min | — | `public UV Min { get ; set ; }` |